# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 7  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [1, 1, 512]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs

# l1: 2
# l2: 8
# c1: 32
# c2: 256
# sr: True
# factor: 2

l1: None
l2: None
c1: None
c2: None
sr: False
factor: None

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f, [64, True]]
  - [-1, 1, Conv, [128, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f, [128, True]] # 4
  - [-1, 1, C2f_SFE, [128]] # 5
  - [-1, 1, Conv, [256, 3, 2]]  # 6-P4/16
  - [-1, 1, C2f, [256, True]] # 7
  - [-1, 1, C2f_SFE, [256]] # 8
  - [-1, 1, Conv, [512, 3, 2]]  # 9-P5/32
  - [-1, 1, C2f_SFE, [512]] # 10
  - [-1, 1, SPPF, [512, 5]]  # 11

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [[-1, 8], 1, Concat, [1]]  # 13 cat backbone P4
  - [-1, 1, C2f, [256]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [[-1, 5], 1, Concat, [1]]  # 16 cat backbone P3
  - [-1, 1, C2f, [128]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]]  # 19 cat head P4
  - [-1, 1, C2f, [256]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 11], 1, Concat, [1]]  # 22 cat head P5
  - [-1, 3, C2f, [512]]  # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
