# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [1, 0.5, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  m: [1, 1, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs

# l1: 2
# l2: 8
# c1: 32
# c2: 256
# sr: True
# factor: 2

l1: None
l2: None
c1: None
c2: None
sr: False
factor: None

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, LSKNet, [[64, 128, 320, 512], 0.1, 0.1]]  # 0
  - [-1, 1, DevideOutputs_gd, [1]]  # 1 p2-8
  - [0, 1, DevideOutputs_gd, [2]]  # 2 p3-16
  - [0, 1, DevideOutputs_gd, [3]]  # 3 p4-32
  

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 4
  - [[-1, 2], 1, Concat, [1]]  # 5 cat backbone P3
  - [-1, 3, C2f, [320]]  # 6

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 7
  - [[-1, 1], 1, Concat, [1]]  # 8 cat backbone P2
  - [-1, 3, C2f, [128]]  # 9 (P2/8-small)

  - [-1, 1, Conv, [128, 3, 2]]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat head P4
  - [-1, 3, C2f, [320]]  # 12 (P3/16-medium)

  - [-1, 1, Conv, [320, 3, 2]]  # 13
  - [[-1, 3], 1, Concat, [1]]  # 14 cat head P5
  - [-1, 3, C2f, [512]]  # 15 (P4/32-large)

  - [[9, 12, 15], 1, Detect, [nc]]  # Detect(P3, P4, P5)
