# Parameters
nc: 7  # number of classes
scales:
  s: [1, 0.5, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  m: [1, 1, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs

# l1: 2
# l2: 8
# c1: 32
# c2: 256
# sr: True
# factor: 2

l1: None
l2: None
c1: None
c2: None
sr: False
factor: None

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, LSKNet, [[64, 128, 320, 512], 0.1, 0.1]]  # 0
  - [-1, 1, DevideOutputs_gd, [1]]  # 1 p2-8
  - [0, 1, DevideOutputs_gd, [2]]  # 2 p3-16
  - [0, 1, DevideOutputs_gd, [3]]  # 3 p4-32


head:
  - [[1, 2, 3], 1, FPN, [256, 3]]  # 4 M5

  - [-1, 1, DevideOutputs_gd, [0]]  # 5 p2-8
  - [4, 1, DevideOutputs_gd, [1]]  # 6 p3-16
  - [4, 1, DevideOutputs_gd, [2]]  # 7 p4-32
  

  - [[5, 6, 7], 1, Detect, [nc]]  # 8 Detect(P3, P4, P5)
