# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 8  # number of classes  FLIR-3, VEDAI-8
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  # rgb stream
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]  # 1 stage 1 128

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8 128
  - [-1, 6, HGBlock, [96, 512, 3]]   # 3 stage 2 512

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P3/16 512
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]  # 5 cm, c2, k, light, shortcut 1024
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 6 1024
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 7 stage 3 1024

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P4/32 1024
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]  # 9 stage 4 2048

  # ir stream
  - [-4, 1, HGStem, [32, 48]]  # 10-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]  # 11 stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 12-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]]   # 13 stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 14-P3/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]  # 15 cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 16
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 17 stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 18-P4/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]  # 19 stage 4

  # fusion
  - [[3, 13], 1, Concat, [1]]  # 20 stage 2
  - [[7, 17], 1, Concat, [1]] # 21 stage 3
  - [[9, 19], 1, Concat, [1]] # 22 stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 23 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]  # 24
  - [-1, 1, Conv, [256, 1, 1]]   # 25, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 26
  - [21, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 27 input_proj.1
  - [[-2, -1], 1, Concat, [1]]  # 28
  - [-1, 3, RepC3, [256, 3, 1.0, 'gelu']]  # 29, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 30, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 31
  - [20, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 32 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 33 cat backbone P4
  - [-1, 3, RepC3, [256, 3, 1.0, 'gelu']]    # 34 X3 (21), fpn_blocks.1 bs*256*80*80

  - [-1, 1, Conv, [256, 3, 2]]   # 35, downsample_convs.0
  - [[-1, 30], 1, Concat, [1]]  # 36 cat Y4
  - [-1, 3, RepC3, [256, 3, 1.0, 'gelu']]    # F4 (37), pan_blocks.0 bs*256*40*40

  - [-1, 1, Conv, [256, 3, 2]]   # 38, downsample_convs.1
  - [[-1, 25], 1, Concat, [1]]  # 39 cat Y5
  - [-1, 3, RepC3, [256, 3, 1.0, 'gelu']]    # F5 (40), pan_blocks.1 bs*256*20*20

  - [[34, 37, 40], 1, RTDETRDecoder_m, [nc]]  # 41 Detect(P3, P4, P5)
