# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [[-1, -10], 1, Concat, [1]] # 0
  - [-1, 1, HGStem, [32, 48]]  # 1-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]  # 2 stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 3-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]]   # 4 stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 5-P3/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]  # 6 cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 7
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 8 stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 9-P4/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]  # 10 stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 11 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]  # 12
  - [-1, 1, Conv, [256, 1, 1]]   # 13, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 15 input_proj.1
  - [[-2, -1], 1, Concat, [1]]  # 16
  - [-1, 3, RepC3, [256]]  # 17, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 18, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 20 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 21 cat backbone P4
  - [-1, 3, RepC3, [256]]    # X3 (22), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 23, downsample_convs.0
  - [[-1, 18], 1, Concat, [1]]  # 24 cat Y4
  - [-1, 3, RepC3, [256]]    # F4 (25), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 26, downsample_convs.1
  - [[-1, 13], 1, Concat, [1]]  # 27 cat Y5
  - [-1, 3, RepC3, [256]]    # F5 (28), pan_blocks.1

  - [[22, 25, 28], 1, RTDETRDecoder, [nc]]  # 29 Detect(P3, P4, P5)
